app/Models/xml/GetParameterRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <cwmp:ID soapenv:mustUnderstand="1" xmlns:cwmp="urn:dslforum-org:cwmp-1-2">1</cwmp:ID>
    </soapenv:Header>
    <soapenv:Body>
        <cwmp:GetParameterValues xmlns:cwmp="urn:dslforum-org:cwmp-1-2">
            <ParameterNames soapenc:arrayType="xsd:string[{@COUNT}]"
                            xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                            xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
                {@PARM_NAME}
            </ParameterNames>
        </cwmp:GetParameterValues>
    </soapenv:Body>
</soapenv:Envelope>
